# Работа с классами
# Инвентаризация продукции** - Напишите приложение, которое управляет инвентаризацией продукции. Создайте класс *product* с ценой, идентификатором, и количеством имеющихся единиц продукта. Далее создайте класс *inventory*, который отслеживает различные продукты и может просуммировать инвентарную стоимость.

# Система бронирования авиакомпании / отеля** - Создайте систему бронирования, которая резервирует места в самолёте или номера в отеле. Создайте различную цену для различных категорий мест или номеров. Например, бизнес-класс стоит дороже, чем эконом-класс. Номера в отеле могут быть пентхаусами и стоить дороже. Отслеживайте, когда те или иные комнаты будут доступны для бронирования.

# Управление компанией** - Создайте иерархию классов - абстрактный класс Employee и подклассы HourlyEmployee, SalariedEmployee, Manager и Executive. Компенсация каждого подкласса вычисляется по-разному, поищите информацию в интернете, чтобы выяснить детали.
# После того, как Вы создали иерархию сотрудников, создайте класс Company, который позволяет Вам управлять сотрудниками. Вы должны уметь нанимать, увольнять и повышать сотрудников. 

# Управление банковским счётом** - Создайте класс Account, который будет абстрактным классом для трёх других классов CheckingAccount, SavingsAccount и BusinessAccount. Управляйте дебетом и кредитом этих счетов по аналогии с банкоматом.

# Расписание пациент / доктор** - Создайте класс patient и класс doctor. Доктор может принимать нескольких пациентов. Напишите программу, которая ведёт расписание приема доктора. В один рабочий день, за 8 часов, доктор может принять только 16 пациентов.

# Создание и управление рецептами** - Создайте класс recipe с ингредиентами рецепта, и поместите их в программу управления рецептами, которая разделяет их на такие категории как десерты, основные блюда и т.д., или разбивает их по ингредиентам - рыбные блюда, мясные блюда, супы, выпечка и т.д.

# Галерея изображений** - Создайте абстрактный класс image и затем подклассы для каждого типа изображения. Поместите их в программу, которая выводит изображения в виде галереи для просмотра.

# Классы Область Фигуры и Периметр** - Создайте абстрактный класс Shape и далее подклассы для таких фигур, как ромб, прямоугольник, круг, треугольник и т.д. В каждом подклассе переопределите Область Фигуры и Периметр для каждого типа фигуры.

# Магазин цветов** - Создайте приложение для магазина цветов, который работает с объектами flower и использует их для создания объекта bouquet, который затем можно продать. Отслеживайте количество объектов, и когда нужно заказывать дополнительные цветы.

# Создание фамильного дерева** - Создайте класс Person с именем, датой рождения и (если его/её уже нет с нами) датой ухода из жизни. Позвольте пользователю создавать классы Person и поместить их в структуру фамильного дерева. Выведите дерево на экран.
