# Базы данных
# Анализатор запросов SQL** - Приложение, в котором пользователь может ввести запрос, выполнить его в локальной базе данных, и рекомендовать как сделать его более эффективным.

# Запуск SQL на удаленных серверах** - Приложение, которое запускает запросы на удаленных серверах с Вашего компьютера через интернет. На входе указывается сервер, имя пользователя и пароль. Программа запускает запрос и возвращает результаты.

# Генератор отчётов** - Напишите программу, которая создает отчёт на основе нескольких таблиц в базе данных. Например, отчёт о продажах на основе таблиц order/order details, суммируя данные по дням.

# Расписание событий и календарь** - Напишите программу, в которой пользователь вводит дату и время события, описание события и затем помещает такие события в календарь. Затем пользователь может просматривать календарь, или искать в нём определенные события. *Опционально: позвольте создавать повторяющиеся события, которые происходят каждый день, каждую неделю, месяц, год и т.д.*

# Бюджет** - Напишите программу, которая ведёт бюджет домохозяйства. Пользователь может добавлять расходы, доходы, и повторяющиеся расходы. И узнать, сколько он накопил или потерял за период времени. *Опционально: позвольте пользователю указать диапазон дат, и покажите сумму входящих и исходящих денег, которые поступили на счет и которые были потрачены за этот период времени.*

# Телепрограмма** - У Вас есть любимое ТВ-шоу, которое Вы не хотите пропустить? У Вас нет возможности записать его и посмотреть позже? Создайте приложение, которое выполнит поиск по различным сайтам с программами телепередач, найдет различные каналы/время/передачи и добавит их в базу данных. И затем база данных / веб-сайт будет отправлять Вам по почте напоминания, что Ваше любимое шоу вот-вот начнется, и подскажет на каком канале.

# Планирование путешествия** - Напишите программу, которая позволяет пользователю составить свой план путешествия, отслеживая в нём бронирования авиабилетов и отелей, достопримечательности, бюджет и расписание.
