# Файлы
# Создание викторин** - Напишите приложение, которое берёт набор вопросов из файла, выбирает из них несколько штук случайным образом, и предлагает студентам в виде викторины. Каждый набор вопросов может быть уникальным, и затем подсчитайте количество правильных ответов, которые ввел пользователь.

# Утилита сортировки файла Excel/CSV** - читает строки из файла, сортирует их, и затем записывает обратно в файл. Пользователь может выбрать вид сортировки (по возрастанию, по убыванию) и поле, по которому следует выполнять сортировку.

# Создание Zip-архива** - Пользователь указывает несколько файлов из различных папок, и программа добавляет их в архив zip. *Опционально: реализуйте компрессию файлов; начните с алгоритма Хаффмана.*

# Генератор PDF** - Приложение читает текстовый файл или файл html, и создает на его основе файл PDF. Отлично подходит для веб-сервиса, где пользователь загружает файл и программа возвращает PDF-файл. *Опционально: разместите программу на GAE или Heroku, если это возможно.*

# Теги Mp3** - Добавляйте и редактируйте теги ID3v1 для файлов MP3. Посмотрите, можете ли Вы добавить в заголовок файла MP3 обложку альбома и другие теги ID3v2.

# Менеджер фрагментов кода** - Ещё одна служебная программа, которая позволяет программистам сохранять функции, классы и другие куски функционала для последующего использования. Разбейте фрагменты кода по типу кода или по языку программирования. *Опционально: добавьте подсветку синтаксиса, в зависимости от языка программирования.*
