# Графика и мультимедиа
# Слайд шоу** - Напишите программу, которая показывает различные картинки в режиме слайд-шоу. *Опционально: добавьте различные визуальные эффекты, такие как плавное появление и исчезновение, перелистывание и другие виды перехода между слайдами.*

# Воспроизведение видео онлайн** - Попытайтесь создать свой собственный потоковый видео-плеер.

# Mp3-плеер** - Простая программа для воспроизведения Ваших любимых музыкальных файлов. Добавьте функции, которых на Ваш взгляд Вам не хватает в Вашем любимом музыкальном плеере.

# Водяные знаки** - У Вас есть некоторые картинки, защищенные авторским правом? Добавьте Ваш собственный логотип или светлый текст на фоне, чтобы никто не мог просто так украсть изображения с Вашего сайта. Напишите программу, которая добавляет водяные знаки в изображение. *Опционально: используйте многопоточность для обработки нескольких изображений одновременно.*

# Черепашья графика** - Создайте поле 20 на 20 клеток. Используйте различные команды, чтобы черепашка рисовала линии на поле - движение вперед, поворот влево или вправо, опустить карандаш, поднять карандаш и т.д.  Пишите в интернете термин "Черепашья графика" для дополнительной информации. *Опционально: добавьте возможность считывать набор команд из файла.*

# Создание GIF** Программа берет несколько изображений (PNG, JPG, TIFF) и создает плавный GIF, который затем можно экспортировать. *Опционально: сделайте программу, которая конвертирует маленькие видео-файлы в GIF.*