# Графы
# Графы из ребер** - Напишите программу, которая создаёт граф или сеть из набора рёбер.

# Эйлеров путь в графе** - Напишите программу, которая получает на входе граф, и на выходе выводит либо Эйлеров путь, либо Эйлеров цикл, или говорит что это невозможно. Эйлеров путь начинается с одной вершины, проходит по всем рёбрам через каждую вершину, и завершается в другой вершине. Эйлеров цикл это Эйлеров путь, который начинается и заканчивается в одной и той же вершине.

# Связанный граф** - Напишите программу, которая получает на входе граф, и на выходе говорит, связаны ли все вершины между собой или нет.

# Алгоритм Дейкстры** - Напишите программу, которая находит кратчайший путь по графу, используя его рёбра.

# *Минимальное остовное дерево** - Напишите программу, которая получает на входе связанный ненаправленный граф с весами рёбер, и выводит минимальное остовное дерево, то есть подграф, который является деревом, содержит все его вершины, и сумма всех весов его рёбер наименьшая. 
