# Сеть
# Программа FTP** - Программа передачи файлов, которая может закачивать и скачивать файлы с удалённого веб-сервера.

# Монитор пропускной способности** - Небольшая служебная программа, которая отслеживает объём данных, переданных и принятых по сети во время Вашей текущей онлайн-сессии. Выясните, в какое время дня Вы используете больше или меньше данных. Сгенерируйте отчёт или график, чтобы показать это.

# Сканирование портов** - Введите IP-адрес и диапазон портов, и программа попытается найти открытые порта этого компьютера, подключаясь к каждому из портов. При успешном подключении указать, что порт открыт.

# Проверка почты (POP3 / IMAP)** - Пользователь вводит учётные данные почтовой записи, веб-сервер / IP-адрес, протокол (POP3 или IMAP), и приложение проверяет почту через заданный интервал времени.

# Определение страны по IP-адресу** - Введите IP-адрес и найдите страну, в которой зарегистрирован этот IP-адрес. *Опционально: определите текущий IP-адрес автоматически.*

# Утилита Whois** - Введите IP-адрес или название хоста, найдите его с помощью whois, и выведите результат.

# Проверка сайта по времени** - Приложение пытается подключиться к веб-сайту или серверу периодически, например каждые 5 минут или указанное количество минут, и проверяет доступность сайта/сервера. Если он недоступен, то программа извещает Вас об этом по электронной почте, или выводит сообщение на экран.
