# Web
# Обработка страницы** - Напишите программу, которая подключается к веб-сайту и извлекает все ссылки, или изображения, и сохраняет их в виде списка. *Опционально: отсортируйте содержимое и исключите дубликаты. Поместите результаты в индексированный файл, в котором легко выполнять поиск.*

# Маркерная доска онлайн** - Напишите программу, которая позволяет рисовать картинки, добавлять надписи и использовать различные цвета. *Опционально: добавьте возможность приглашать друзей и совместно работать онлайн на одной и той же маркерной доске.*

# Получить атомное время из интернета** - Напишите программу, которая получает правильное атомное время из любого ресурса атомных часов в интернете - найдите такой ресурс с помощью простого поиска в Google.

# Получить текущую погоду** - получите текущую погоду для указанного почтового индекса. *Опционально: попробуйте автоматически определить местоположение пользователя.*

# Автоматический вход на сайт и выполнение действия** - Напишите программу, которая по расписанию выполняет вход на сайт, выполняет определённое действие, и выходит с сайта. Это может быть полезно например для проверки веб-почты, регулярной публикации контента, или получения информации и её сохранения на своем компьютере. 

# Генератор электронных открыток** - Создайте сайт, который позволяет людям создавать свои собственные маленькие электронные открытки, и отправлять их другим людям. Не используйте Flash. Используйте библиотеку картинок, и возможно надписи или цитаты.

# *Система управления контентом (Content Management System)** - такая как Joomla, Drupal, PHP Nuke и т.д. Сделайте базовые элементы системы. *Опционально: реализуйте добавление модулей/плагинов.*

# Веб-форум** - Создайте форум для себя и свои друзей, чтобы публиковать и делиться мыслями и идеями.

# Создание CAPTCHA** - Вы когда-либо видели изображения с буквами и цифрами - когда Вы подключаетесь к системе, Вас спрашивают, что Вы видите на картинке? Это позволяет защититься от ботов, которые автоматически регистрируются и публикуют спам. Создайте такой генератор картинок самостоятельно.
