# Встроенные методы Python позволяют более обширно работать с строковым элементом, посредством функций:
# Изменение регистра
    # .capitalize()     - Увеличение первого символа строки
    # .upper()          - Увеличение всех символов строки
    # .lower()          - Уменьшение всех символов строки

# Обнаружение подстроки и подсчет
    # .count('')       - Обнаружение символа в строке с выдачей количества его появлений
    # .find('')        - Обнаружение символа в строке с выдачей его индекса первого вхождения

# Проверка
    # .isalnum()        - Возвращает True если все символы являются алфавитно-числовыми
    # .isalpha()        - Возвращает True если все символы являются алфавитными  
    # .islower()        - Возвращает True если все символы являются прописными
    # .isspace()        - Возвращает True если все символы являются пустыми
    # .istitle()        - Возвращает True если каждое слово начинается с заглавной буквы
    # .isupper()        - Возвращает True если все символы являются заглавными
    # .endswith('')     - Возвращает True, если текст заканчивается на указанный символ