# Для работы со списками есть также более расширенные методы:
    # lst.append(x)             - добавление элемента в конец списка (элементом может быть и другой список)
    # lst.extend(x)             - добавление элементов из объекта в список
    # lst.insert(index,object)  - вставляет объект в список на конкретную позицию
    # lst.pop(x)                - изымает объект из списка по его позиции в индексе или значению
    # lst.remove(x)             - удаляет указанное значение из списка
    # lst.reverse()             - переворачивает порядок значений списка

    # lst.index(x)                      - возвращает позицию указанного объекта, иначе выдает ошибку
    # lst.count(x)                      - подсчет повторений данного элемента в списке 
    # lst.sort(reverse=T/F, key=func)   - сортируе список по указанным параметрам
